<!-- THIS FILE IS @autogenerated DO NOT EDIT -->

## Table of Contens

1. [$abs](#abs)
2. [$all](#all)
3. [$any](#any)
4. [$bool](#bool)
5. [$concat](#concat)
6. [$endsWith](#endsWith)
7. [$float](#float)
8. [$format](#format)
9. [$getattr](#getattr)
10. [$hasattr](#hasattr)
11. [$if](#if)
12. [$includes](#includes)
13. [$int](#int)
14. [$isinstance](#isinstance)
15. [$isnil](#isnil)
16. [$isset](#isset)
17. [$len](#len)
18. [$lower](#lower)
19. [$math](#math)
20. [$max](#max)
21. [$min](#min)
22. [$now](#now)
23. [$pow](#pow)
24. [$round](#round)
25. [$startsWith](#startsWith)
26. [$str](#str)
27. [$substring](#substring)
28. [$tisboolean](#tisboolean)
29. [$tisnumber](#tisnumber)
30. [$tisobject](#tisobject)
31. [$tisstring](#tisstring)
32. [$tisundefined](#tisundefined)
33. [$type](#type)
34. [$upper](#upper)

## Documentation

### `$abs` 

Return the absolute value of the argument.


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$abs(42)`<br />
Output: `42`<br />




---

#### Example No.2



Input: `$abs($x)`<br />
Output: `NaN`<br />



Context: 
`{"vars":{"$x":"hello, world!"}}`

---


</details>

### `$all` 

Return `true` if `$bool(x)` is `true` for all values x in the passed arguments


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$all(true, false, true)`<br />
Output: `false`<br />




---

#### Example No.2



Input: `$all(true, true)`<br />
Output: `true`<br />




---


</details>

### `$any` 

Return `true` if `$bool(x)` is `true` for any x in the passed arguments


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$any(true, false, true)`<br />
Output: `true`<br />




---

#### Example No.2



Input: `$any(true, true)`<br />
Output: `true`<br />




---

#### Example No.3



Input: `$any(false, false, false, false)`<br />
Output: `false`<br />




---

#### Example No.4



Input: `$any(false)`<br />
Output: `false`<br />




---


</details>

### `$bool` 

Returns `true` when the argument x is `true`, False otherwise. If **not** a valid boolean it will check truthiness (`!!x`).


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$bool(false)`<br />
Output: `false`<br />




---

#### Example No.2



Input: `$bool(0)`<br />
Output: `false`<br />




---

#### Example No.3



Input: `$bool(0.0)`<br />
Output: `false`<br />




---

#### Example No.4



Input: `$bool(true)`<br />
Output: `true`<br />




---

#### Example No.5



Input: `$bool(1)`<br />
Output: `true`<br />




---

#### Example No.6



Input: `$bool(1.0)`<br />
Output: `true`<br />




---

#### Example No.7



Input: `$bool($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":""}}`

---

#### Example No.8



Input: `$bool($x)`<br />
Output: `true`<br />



Context: 
`{"vars":{"$x":"Hello, world!"}}`

---


</details>

### `$concat` 

Concatenate values


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$concat($a, $b, $c, $d, $e)`<br />
Output: `true42HelloWorld!{}`<br />



Context: 
`{"vars":{"$a":true,"$b":42,"$c":"Hello","$d":"World!","$e":{}}}`

---


</details>

### `$endsWith` 

Checks to see if values ends with a value


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$endsWith($x, 'b')`<br />
Output: `true`<br />



Context: 
`{"vars":{"$x":"Hello, b"}}`

---

#### Example No.2



Input: `$endsWith($x, 'z')`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":"Hello, b"}}`

---

#### Example No.3



Input: `$endsWith($x, ", b")`<br />
Output: `true`<br />



Context: 
`{"vars":{"$x":"Hello, b"}}`

---

#### Example No.4



Input: `$endsWith($x, '')`<br />
Output: `true`<br />



Context: 
`{"vars":{"$x":"Hello, b"}}`

---


</details>

### `$float` 

Convert a string or number to a floating point number, if possible.


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$float()`<br />
Output: `NaN`<br />




---

#### Example No.2



Input: `$float(42)`<br />
Output: `42`<br />




---

#### Example No.3



Input: `$float($x)`<br />
Output: `42.2`<br />



Context: 
`{"vars":{"$x":"42.2"}}`

---

#### Example No.4



Input: `$float($x)`<br />
Output: `NaN`<br />



Context: 
`{"vars":{"$x":"hello"}}`

---


</details>

### `$format` 

Pass values to a template string (see examples).


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$format($fmt, $name, $animal)`<br />
Output: `This is Garfield a cat. Garfield likes lasagna.`<br />



Context: 
`{"vars":{"$fmt":"This is {0} a {1}. {0} likes lasagna.","$name":"Garfield","$animal":"cat"}}`

---


</details>

### `$getattr` 

Get attribute of an oject


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$getattr($x, "length")`<br />
Output: `11`<br />



Context: 
`{"vars":{"$x":"some string"}}`

---

#### Example No.2



Input: `$getattr($x, "some.deep.object")`<br />
Output: `42`<br />



Context: 
`{"vars":{"$x":{"some":{"deep":{"object":42}}}}}`

---

#### Example No.3



Input: `$getattr($x, 'some', "deep", $attrobject)`<br />
Output: `42`<br />



Context: 
`{"vars":{"$x":{"some":{"deep":{"object":42}}},"$attrobject":"object"}}`

---

#### Example No.4



Input: `$getattr($x, "some.tricky", 'deep.object')`<br />
Output: `42`<br />



Context: 
`{"vars":{"$x":{"some.tricky":{"deep":{"object":42}}}}}`

---


</details>

### `$hasattr` 

Wrapper for `$bool($getattr($obj, 'example.path'))` and also checks for `$` at the start of the result


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$hasattr($x, 'some.attr')`<br />
Output: `true`<br />



Context: 
`{"vars":{"$x":{"some":{"attr":42}}}}`

---

#### Example No.2



Input: `$hasattr($x, 'other.attr')`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":{"some":{"attr":42}}}}`

---


</details>

### `$if` 

If statement like trenery operator


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$if(true, $whenTrue, $whenFalse)`<br />
Output: `this is true`<br />



Context: 
`{"vars":{"$whenTrue":"this is true","$whenFalse":"this is false"}}`

---

#### Example No.2



Input: `$if(false, $whenTrue, $whenFalse)`<br />
Output: `this is false`<br />



Context: 
`{"vars":{"$whenTrue":"this is true","$whenFalse":"this is false"}}`

---

#### Example No.3



Input: `$if($all($isLoggedIn, $bool($getattr($client, 'user.name'))), $format($welcomeMessage, $getattr($client, 'user.name')), $welcomeMessage2)`<br />
Output: `Hi James, welcome to the app!`<br />



Context: 
`{"vars":{"$isLoggedIn":true,"$welcomeMessage":"Hi {0}, welcome to the app!","$welcomeMessage2":"Hi, welcome to the app!","$client":{"user":{"name":"James"}}}}`

---

#### Example No.4



Input: `$if($all($isLoggedIn, $bool($getattr($client, 'user.name'))), $format($welcomeMessage, $getattr($client, 'user.name')), $welcomeMessage2)`<br />
Output: `Hi, welcome to the app!`<br />



Context: 
`{"vars":{"$isLoggedIn":false,"$welcomeMessage":"Hi {0}, welcome to the app!","$welcomeMessage2":"Hi, welcome to the app!"}}`

---

#### Example No.5



Input: `$if($all($isLoggedIn, $hasattr($client, 'user.name')), $format($welcomeMessage, $getattr($client, 'user.name')), $welcomeMessage2)`<br />
Output: `Hi, welcome to the app!`<br />



Context: 
`{"vars":{"$isLoggedIn":true,"$welcomeMessage":"Hi {0}, welcome to the app!","$welcomeMessage2":"Hi, welcome to the app!"}}`

---


</details>

### `$includes` 

Checks to see if array-like variable contains a value


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$includes($arr, 'a')`<br />
Output: `true`<br />



Context: 
`{"vars":{"$arr":["a","b"]}}`

---

#### Example No.2



Input: `$includes($arr, 'z')`<br />
Output: `false`<br />



Context: 
`{"vars":{"$arr":["a","b"]}}`

---

#### Example No.3



Input: `$includes($set, 'z')`<br />
Output: `false`<br />



Context: 
`{"vars":{"$set":{}}}`

---

#### Example No.4



Input: `$includes($set, 'b')`<br />
Output: `true`<br />



Context: 
`{"vars":{"$set":{}}}`

---


</details>

### `$int` 

Convert a string or number to an integer, if possible.


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$int()`<br />
Output: `NaN`<br />




---

#### Example No.2



Input: `$int(42)`<br />
Output: `42`<br />




---

#### Example No.3



Input: `$int($x)`<br />
Output: `42`<br />



Context: 
`{"vars":{"$x":"42.2"}}`

---

#### Example No.4



Input: `$int($x)`<br />
Output: `NaN`<br />



Context: 
`{"vars":{"$x":"hello"}}`

---


</details>

### `$isinstance`


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$isinstance($x, $strType, $numType)`<br />
Output: `true`<br />



Context: 
`{"vars":{"$x":"hello","$strType":"string","$numType":"number"}}`

---

#### Example No.2



Input: `$isinstance($x, $strType, $numType)`<br />
Output: `true`<br />



Context: 
`{"vars":{"$x":42,"$strType":"string","$numType":"number"}}`

---

#### Example No.3



Input: `$isinstance($x, $strType, $numType)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":true,"$strType":"string","$numType":"number"}}`

---

#### Example No.4



Input: `$isinstance($x, $boolType, $numType)`<br />
Output: `true`<br />



Context: 
`{"vars":{"$x":true,"$boolType":"boolean"}}`

---


</details>

### `$isnil` 

Returns `true` if `x` is `undefined` **or** `null`


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$isnil($x)`<br />
Output: `true`<br />



Context: 
`{"vars":{"$x":null}}`

---

#### Example No.2



Input: `$isnil($x)`<br />
Output: `true`<br />



Context: 
`{"vars":{}}`

---

#### Example No.3



Input: `$isnil($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":{"hello":"42"}}}`

---

#### Example No.4



Input: `$isnil($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":0}}`

---

#### Example No.5



Input: `$isnil($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":""}}`

---


</details>

### `$isset`


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$isset($y)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":{"some":{"attr":42}}}}`

---

#### Example No.2



Input: `$isset($x)`<br />
Output: `true`<br />



Context: 
`{"vars":{"$x":{"some":{"attr":42}}}}`

---


</details>

### `$len` 

Will convert `x` into a string and calculate its `length`/`characters`


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$len($x)`<br />
Output: `4`<br />



Context: 
`{"vars":{"$x":true}}`

---

#### Example No.2



Input: `$len($x)`<br />
Output: `2`<br />



Context: 
`{"vars":{"$x":42}}`

---

#### Example No.3



Input: `$len($x)`<br />
Output: `5`<br />



Context: 
`{"vars":{"$x":"Hello"}}`

---

#### Example No.4



Input: `$len($x)`<br />
Output: `18`<br />



Context: 
`{"vars":{"$x":{"hello":"world!"}}}`

---


</details>

### `$lower` 

Lowercase value


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$lower($x)`<br />
Output: `hello, world!`<br />



Context: 
`{"vars":{"$x":"Hello, World!"}}`

---


</details>

### `$math` 

An intrinsic function that provides basic mathematics functionality and constants. It will call the `Math` object in the `js` impl.


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$math('PI')`<br />
Output: `3.141592653589793`<br />



Context: 
`{}`

---

#### Example No.2



Input: `$math('cos', 90)`<br />
Output: `-0.4480736161291702`<br />



Context: 
`{}`

---

#### Example No.3



Input: `$math('someUnknownFunction', 90)`<br />
Output: `$math('someUnknownFunction', 90)`<br />



Context: 
`{}`

---

#### Example No.4



Input: `$math('someUnknownVar')`<br />
Output: `$math('someUnknownVar')`<br />



Context: 
`{}`

---


</details>

### `$max` 

Will return biggest item in arguments. It will convert all items into strins and parse them into floats (see impl)


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$max(1, 2, 3, 4, $x)`<br />
Output: `4`<br />



Context: 
`{"vars":{"$x":true}}`

---

#### Example No.2



Input: `$max(1, 2, 3, 4, $x)`<br />
Output: `50`<br />



Context: 
`{"vars":{"$x":50}}`

---

#### Example No.3



Input: `$max(1, 2, 3, 4, $x)`<br />
Output: `4`<br />



Context: 
`{"vars":{"$x":"hello"}}`

---

#### Example No.4



Input: `$max(1, 2, 3, 4, $x)`<br />
Output: `4`<br />



Context: 
`{"vars":{"$x":-1}}`

---


</details>

### `$min` 

Will return smallest item in arguments. It will convert all items into strins and parse them into floats (see impl)


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$min(1, 2, 3, 4, $x)`<br />
Output: `1`<br />



Context: 
`{"vars":{"$x":true}}`

---

#### Example No.2



Input: `$min(1, 2, 3, 4, $x)`<br />
Output: `1`<br />



Context: 
`{"vars":{"$x":50}}`

---

#### Example No.3



Input: `$min(1, 3, 4, $x, 2)`<br />
Output: `1`<br />



Context: 
`{"vars":{"$x":"hello"}}`

---

#### Example No.4



Input: `$min(1, 2, 3, $x)`<br />
Output: `-1`<br />



Context: 
`{"vars":{"$x":-1}}`

---


</details>

### `$now` 

Gets current datetime


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$now()`<br />





---


</details>

### `$pow` 

Will take `x` to the power of `y` (`x ^ y`)


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$pow(1, 1)`<br />
Output: `1`<br />




---

#### Example No.2



Input: `$pow(2, 1)`<br />
Output: `2`<br />




---

#### Example No.3



Input: `$pow(2, 42)`<br />
Output: `4398046511104`<br />




---


</details>

### `$round` 

Returns a supplied numeric expression rounded to the nearest integer.


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$round(2.020)`<br />
Output: `2`<br />




---

#### Example No.2



Input: `$round(2)`<br />
Output: `2`<br />




---

#### Example No.3



Input: `$round(2.202)`<br />
Output: `2`<br />




---

#### Example No.4



Input: `$round(true)`<br />
Output: `NaN`<br />




---


</details>

### `$startsWith` 

Checks if value starts with value


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$startsWith($x, 'Hello')`<br />
Output: `true`<br />



Context: 
`{"vars":{"$x":"Hello, b"}}`

---

#### Example No.2



Input: `$startsWith($x, 'Hola')`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":"Hello, b"}}`

---

#### Example No.3



Input: `$startsWith($x, '')`<br />
Output: `true`<br />



Context: 
`{"vars":{"$x":"Hello, b"}}`

---


</details>

### `$str` 

Create a new string object from the given object.


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$str($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":false}}`

---

#### Example No.2



Input: `$str($x)`<br />
Output: `{"a":1,"b":{"c":2,"d":"[Circular]"}}`<br />



Context: 
`{"vars":{"$x":{"a":1,"b":{"c":2,"d":"[Circular]"}}}}`

---

#### Example No.3



Input: `$str($x)`<br />
Output: `42`<br />



Context: 
`{"vars":{"$x":42}}`

---

#### Example No.4



Input: `$str($x)`<br />
Output: `Hello, World!`<br />



Context: 
`{"vars":{"$x":"Hello, World!"}}`

---

#### Example No.5



Input: `$str($x)`<br />
Output: `{"hello":"world"}`<br />



Context: 
`{"vars":{"$x":{"hello":"world"}}}`

---


</details>

### `$substring` 

Will coerce `x` into a string and slice it on `start` and `end`


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$substring($x, 0, 4)`<br />
Output: `hell`<br />



Context: 
`{"vars":{"$x":"hello"}}`

---

#### Example No.2



Input: `$substring($x, 1)`<br />
Output: `ello`<br />



Context: 
`{"vars":{"$x":"hello"}}`

---

#### Example No.3



Input: `$substring($x)`<br />
Output: `hello`<br />



Context: 
`{"vars":{"$x":"hello"}}`

---

#### Example No.4



Input: `$substring($x, 0, $len($x) - 1)`<br />
Output: `hell`<br />



Context: 
`{"vars":{"$x":"hello"}}`

---


</details>

### `$tisboolean` 

Wrapper for `$isinstance(x, 'boolean')`


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$tisboolean($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":"hello"}}`

---

#### Example No.2



Input: `$tisboolean($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":42}}`

---

#### Example No.3



Input: `$tisboolean($x)`<br />
Output: `true`<br />



Context: 
`{"vars":{"$x":true}}`

---

#### Example No.4



Input: `$tisboolean($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{}}`

---

#### Example No.5



Input: `$tisboolean($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":{"hello":"42"}}}`

---


</details>

### `$tisnumber` 

Wrapper for `$isinstance(x, 'number', 'bigint')`


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$tisnumber($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":"hello"}}`

---

#### Example No.2



Input: `$tisnumber($x)`<br />
Output: `true`<br />



Context: 
`{"vars":{"$x":42}}`

---

#### Example No.3



Input: `$tisnumber($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":true}}`

---

#### Example No.4



Input: `$tisnumber($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{}}`

---

#### Example No.5



Input: `$tisnumber($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":{"hello":"42"}}}`

---


</details>

### `$tisobject` 

Wrapper for `$isinstance(x, 'object')`


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$tisobject($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":"hello"}}`

---

#### Example No.2



Input: `$tisobject($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":42}}`

---

#### Example No.3



Input: `$tisobject($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":true}}`

---

#### Example No.4



Input: `$tisobject($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{}}`

---

#### Example No.5



Input: `$tisobject($x)`<br />
Output: `true`<br />



Context: 
`{"vars":{"$x":{"hello":"42"}}}`

---


</details>

### `$tisstring` 

Wrapper for `$isinstance(x, 'string')`


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$tisstring($x)`<br />
Output: `true`<br />



Context: 
`{"vars":{"$x":"hello"}}`

---

#### Example No.2



Input: `$tisstring($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":42}}`

---

#### Example No.3



Input: `$tisstring($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":true}}`

---

#### Example No.4



Input: `$tisstring($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{}}`

---

#### Example No.5



Input: `$tisstring($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":{"hello":"42"}}}`

---


</details>

### `$tisundefined` 

Wrapper for `$isinstance(x, 'undefined')`


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$tisundefined($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":"hello"}}`

---

#### Example No.2



Input: `$tisundefined($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":42}}`

---

#### Example No.3



Input: `$tisundefined($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":true}}`

---

#### Example No.4



Input: `$tisundefined($x)`<br />
Output: `true`<br />



Context: 
`{"vars":{}}`

---

#### Example No.5



Input: `$tisundefined($x)`<br />
Output: `false`<br />



Context: 
`{"vars":{"$x":{"hello":"42"}}}`

---


</details>

### `$type` 

Returns `typeof x`


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$type($x)`<br />
Output: `string`<br />



Context: 
`{"vars":{"$x":"hello"}}`

---

#### Example No.2



Input: `$type($x)`<br />
Output: `number`<br />



Context: 
`{"vars":{"$x":42}}`

---

#### Example No.3



Input: `$type($x)`<br />
Output: `boolean`<br />



Context: 
`{"vars":{"$x":true}}`

---

#### Example No.4



Input: `$type($x)`<br />
Output: `undefined`<br />



Context: 
`{"vars":{}}`

---

#### Example No.5



Input: `$type($x)`<br />
Output: `object`<br />



Context: 
`{"vars":{"$x":{"hello":"42"}}}`

---


</details>

### `$upper` 

Uppercase value


<details>
<summary>Examples</summary>

#### Example No.1



Input: `$upper($x)`<br />
Output: `HELLO, WORLD!`<br />



Context: 
`{"vars":{"$x":"Hello, World!"}}`

---


</details>